/* 
    -자료형
        0.undefined     : 자료없다. 
        1.숫자  2.문자열    3.불    
        4.배열[]         : 여러개의 자료를 모은 하나의 자료집합
            -성질, 상태 , 필드 = 현재 테이터의 상태    
        5.함수(){}       : 코드 집합
            -행위, 이벤트, 메소드

    함수
        -코드의 집합을 나타내는 자료형.
        -용어
            -함수호출   : 함수사용할때  f(x)
            -매개변수   : 함수호출할때 함수 내부에 여러가지 *자료를 넣을때 =인수
            -리턴값     : 함수호출해서 최종적으로 나오는 결과 = 반환 return

        -함수를 사용하면 좋은점.
            1. 반복되는 코드를 한번에 정의하고 필요에 따라 호출해서 반복 작없을 피할 수 있다.[코드 양 줄어듬]
            2. 긴 프로그램을 기능별로 나눠 여러 함수로 작성하면 모듈화(조각/쪼개서 단위)로 전체 코드의 가독성이 좋아짐
            3. 기능별(함수별)로 수정이 가능하므로 유지보수가 쉽다.
        1.익명함수: 이름이 없는 함수.
*/

//p. 197 *익명함수.